XML/lmi_create_ims_reg_pbx_pilot_marc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:ns="http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/">
   <soapenv:Header>
      <cai3:SessionId>{0}</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Create>
         <cai3:MOType>IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</cai3:MOType>
         <cai3:MOId>
            <ns:subscriberId>{1}{2}</ns:subscriberId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <ns:createIMSSubscription subscriberId="{1}{2}">
               <ns:subscriberId>{1}{2}</ns:subscriberId>
               <ns:subscriberBarringInd>FALSE</ns:subscriberBarringInd>
               <ns:defaultPrivateId>{1}{2}</ns:defaultPrivateId>
               <ns:pubData publicIdValue="sip:{1}{2}">
                  <ns:publicIdValue>sip:{1}{2}</ns:publicIdValue>
                  <ns:privateUserId>{1}{2}</ns:privateUserId>
                  <ns:xcapAllowed>FALSE</ns:xcapAllowed>
                  <ns:implicitRegSet>1</ns:implicitRegSet>
                  <ns:isDefault>TRUE</ns:isDefault>
                  <ns:configuredServiceProfiles configuredServiceProfileId="{3}">
                     <ns:configuredServiceProfileId>{3}</ns:configuredServiceProfileId>
                  </ns:configuredServiceProfiles>
               </ns:pubData>
               <ns:privateUser privateUserId="{1}{2}">
                  <ns:privateUserId>{1}{2}</ns:privateUserId>
                  <ns:userPassword>{4}</ns:userPassword>
                  <ns:roamingAllowed>FALSE</ns:roamingAllowed>
                  <ns:allowedAuthMechanism>Digest</ns:allowedAuthMechanism>
               </ns:privateUser>
            </ns:createIMSSubscription>
         </cai3:MOAttributes>
      </cai3:Create>
   </soapenv:Body>
</soapenv:Envelope>
